Suppose that a website contains two tables, the Customers table and the Orders table. Write a SQL query to find all customers who never order anything.

Table: Customers.


| Id | Name  |
|----|-------|
| 1  | Joe   |
| 2  | Henry |
| 3  | Sam   |
| 4  | Max   |

Table: Orders.


| Id | CustomerId |
|----|------------|
| 1  | 3          |
| 2  | 1          |

Using the above tables as example, return the following:


| Customers |
|-----------|
| Henry     |
| Max       |



```mysql
drop table if exists Customers;
drop table if exists Orders;

Create table If Not Exists Customers (Id int, Name varchar(255));
Create table If Not Exists Orders (Id int, CustomerId int);
Truncate table Customers;
insert into Customers (Id, Name) values ('1', 'Joe');
insert into Customers (Id, Name) values ('2', 'Henry');
insert into Customers (Id, Name) values ('3', 'Sam');
insert into Customers (Id, Name) values ('4', 'Max');
Truncate table Orders;
insert into Orders (Id, CustomerId) values ('1', '3');
insert into Orders (Id, CustomerId) values ('2', '1');
`

In [14]:
# Create connection:
import mysql.connector
import pandas as pd
def query(query):
        mySql_connector = mysql.connector.connect(
        host="localhost",
        user="root",
        passwd="new_passowrd",
        database="leedcode_test", 
        auth_plugin='mysql_native_password' # required
        )
        data= pd.read_sql_query(query , mySql_connector)
        return data

In [15]:
query("""
SELECT * FROM Customers;""")

   Id   Name
0   1    Joe
1   2  Henry
2   3    Sam
3   4    Max

In [16]:
query("""
SELECT * FROM Orders;""")

   Id  CustomerId
0   1           3
1   2           1

In [17]:
query('''
select *
from Customers as c
left join Orders as o on c.Id = o.CustomerId
where CustomerId is null

''')

  Id   Name    Id CustomerId
0  2  Henry  None       None
1  4    Max  None       None

In [20]:
query('''
select c.name as Customers
from Customers as c
left join Orders as o on c.Id = o.CustomerId
where CustomerId is null

''')

  Customers
0     Henry
1       Max

# Another Approach

In [24]:
query('''
select c.name as 'Customers'
from Customers c
where c.id not in
(
    select CustomerId from Orders
);

''')

  Customers
0     Henry
1       Max